#Для закрепления предыдущего материала). Объявите функцию с именем str_min, которая сравнивает две переданные строки и возвращает минимальную из них (то есть, выполняется лексикографическое сравнение строк). Затем, используя функциональный подход к программированию (то есть, более сложные функции реализуются путем вызова более простых), реализовать еще две аналогичные функции:

def str_min(*s:str):
    return min(*s)
def str_min3(*s:str):
    return min(*s)
def str_min4(*s:str):
    return min(*s)