#Написать программу ввода строки и формирования новой строчки вида: "Строка: <введенная строка>. Длина: <длина строки>". Результат сформированной строки вывести на экран.
s=input()
print(f"Строка: {s}. Длина: {len(s)}")