#Выведите в консоль их значения в столбик (каждое новое значение отображается с новой строчки), используя одну функцию print.
a,b,c=7,-4,3
print(f"{a}\n{b}\n{c}")