#Задайте функцию, которая не принимает никаких аргументов и просто выводит на экран строку:

#It's my first function
def print_mess(mes="It's my first function"):
    print(mes)
print_mess()